[   
    {
        "stars": 5,
        "description": "Trace did a great job in restoring the original shine to my windows. With my home being on the older side, I was concerned that the years of rain and dirt would be permanently visible. I am truly amazed and kinda surprised that the glass looks as good as it does. Trace took the time and care in making sure my windows look great.",
        "customer": "John Sosa"
    },
    {
        "stars": 5,
        "description": "Trace epitomizes professionalism and great work ethic. He cleaned the inside and outside windows of my home and they have never looked better! We have had a lot of construction around our area lately and they have collected so much grime and dirt. He is quick and efficient, as it only took a few hours if that to get the job done. Give Optimal Exterior a call today to make those windows fresh and clean!!!",
        "customer": "Paige Finley"
    },
    {
        "stars": 5,
        "description": "Trace and team did an excellent job on our home. They cleaned our roof, windows and driveway. The before and after is night and day and I couldn’t be happier with the end result. Their professionalism and attention to detail were outstanding. Highly recommend!",
        "customer": "John Stanley"
    },
    {
        "stars": 5,
        "description": "Optimal Exterior did an outstanding job cleaning our very dirty windows!  Jessica and Trace are professional, friendly efficient and, reasonably priced!  I am having them come back to do additional work!",
        "customer": "Kathy Murray"
    },
    {
        "stars": 5,
        "description": "We hired Optimal Exterior to clean our dirty stained roof. They worked hard and the roof looks brand new! Before our roof was streaked and almost black with mold from years in the humid weather. After the cleaning we got to see the original color of our gray roof. It looks so much better now! I would highly recommend them for any exterior home cleaning you may need!",
        "customer": "Carrie Jackson"
    },
    {
        "stars": 5,
        "description": "Made my windows sparkle!  Trace made sure the job was done right. He was careful with my personal items, respectful of my property and very professional. I highly recommend Optimal and Trace for any of the services he offers. You will not be disappointed.",
        "customer": "Trina Fowlkes"
    },
    {
        "stars": 5,
        "description": "Trace did a phenomenal job. When we moved in a few months back, I couldn’t stand how dirty the windows were. I did the power washer thing, the Windex/hose thing, the complain to my husband thing. I began “hinting” (I’m not subtle) to my husband every weekend that the windows were on his task list. Trace saved my marriage and my sanity. I’m leaving the blinds up until the neighbors complain!",
        "customer": "Meredith Brister"
    },
    
    {
        "stars": 5,
        "description": "Optimal Exterior did an amazing job cleaning the windows, both inside and outside, on out three story home. The quote was competitive, they were on time, and were diligent about make sure everything was truly clean before leaving. I highly recommend their service.",
        "customer": "Kinjal S"
    },
    {
        "stars": 5,
        "description": "Looks like i bought a brand new home. Showed up on time even with a storm coming in. Had to pack up when the weather got bad but promised to come back. Literally pulled in my driveway as the rain stopped. Very fast and efficient work that would've taken me a week. Very respectful and hard working. Answered any question i had and treated my house as his. Seriously looks like i have a new roof, new windows, on a new house.",
        "customer": "Geoff Stroud"
    },
    {
        "stars": 5,
        "description": "Roof is night and day better. I have a lot of leaves that accumulate on my roof. Trace cleaned up the roof and brought the shingles back to life. This will definitely extend the life of my roof and prevent headaches in the future. Thanks optimal exterior!!",
        "customer": "zscrog"
    },
    {
        "stars": 5,
        "description": "We had a fantastic experience with Optimal Exterior. They were very quick to respond to my initial request, came to the house and were very professional. Great pricing and really good work so it was a win-win all around. I would highly recommend them!",
        "customer": "Christy Abrams"
    },
    {
        "stars": 5,
        "description": "I had my driveway and patio power washed, my windows washed and my fence power washed.  Trace does a fabulous job!!!   Everything looks better than I ever imagined it could!",
        "customer": "Debbie Blailock"
    }
]
